UCB_CS61_lec21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 23:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第二十一课 Dictionaries &amp; HashTable</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第二十一课 Dictionaries &amp; HashTable</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4f161cd">1. DICTIONARIES</a></li>
<li><a href="#orga97ee5a">2. Hash Tables (the most common implementation of dictionaries)</a>
<ul>
<li><a href="#orga7ce9a3">2.1. what is a hash table?</a></li>
<li><a href="#org0718c29">2.2. from Dictionaries to hashtable</a></li>
<li><a href="#org9298ed2">2.3. hash table: java</a></li>
</ul>
</li>
<li><a href="#org82cc3ec">3. Hash Codes and Compression Functions</a>
<ul>
<li><a href="#org21edcef">3.1. hashcode: lec-note</a></li>
<li><a href="#orgacd9eb9">3.2. Performance of Hash Table:</a></li>
<li><a href="#org2b54082">3.3. Troublesome 1: Compression fn</a></li>
<li><a href="#org8eee088">3.4. Troublesome 2: H</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="org4f161cd" class="outline-2">
<h2 id="org4f161cd"><span class="section-number-2">1</span> DICTIONARIES</h2>
<div class="outline-text-2" id="text-1">
<p>
Suppose you have a set of two-letter words and their definitions. You want to be
able to look up the definition of any word, very quickly. The two-letter word is
the <span class="underline">key</span> that addresses the definition.
</p>

<p>
Since there are 26 English letters, there are 26 * 26 = 676 possible two-letter
words. To implement a dictionary, we declare an array of 676 references, all
initially set to null. To insert a Definition into the dictionary, we define a
function hashCode() that maps each two-letter word (key) to a unique integer
between 0 and 675. We use this integer as an index into the array, and make the
corresponding bucket (array position) point to the Definition object.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Word</span> {
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">LETTERS</span> = <span style="color: #a45bad;">26</span>, <span style="color: #7590db;">WORDS</span> = LETTERS * LETTERS;
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">word</span>;

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">hashCode</span>() {                  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Map a two-letter Word to 0...675.</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> LETTERS * (word.charAt(<span style="color: #a45bad;">0</span>) - <span style="color: #2d9574;">'a'</span>) + (word.charAt(<span style="color: #a45bad;">1</span>) - <span style="color: #2d9574;">'a'</span>);
  }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">WordDictionary</span> {
  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">Definition</span>[] <span style="color: #7590db;">defTable</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Definition</span>[<span style="color: #a45bad;">Word</span>.WORDS];

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">insert</span>(<span style="color: #ce537a; font-weight: bold;">Word</span> <span style="color: #7590db;">w</span>, <span style="color: #ce537a; font-weight: bold;">Definition</span> <span style="color: #7590db;">d</span>) {
    defTable[w.hashCode()] = d;               <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Insert (w, d) into Dictionary.</span>
  }

  <span style="color: #ce537a; font-weight: bold;">Definition</span> <span style="color: #bc6ec5; font-weight: bold;">find</span>(<span style="color: #ce537a; font-weight: bold;">Word</span> <span style="color: #7590db;">w</span>) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> defTable[w.hashCode()];               <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Return the Definition of w.</span>
  }
}

</pre>
</div>

<p>
What if we want to store every English word, not just the two-letter words?
The table "defTable" must be long enough to accommodate
pneumonoultramicroscopicsilicovolcanoconiosis, 45 letters long.  Unfortunately,
declaring an array of length 26^45 is out of the question.  English has fewer
than one million words, so we should be able to do better.
</p>
</div>
</div>
