UCB_CS61_lec21.org
* Hash Tables (the most common implementation of dictionaries)
Suppose n is the number of keys (words) whose definitions we want to store, and
suppose we use a table of N buckets, where N is perhaps a bit larger than n, but
much smaller than the number of _possible_ keys. A hash table maps a huge set of
possible keys into N buckets by applying a _compression_function_ to each hash
code. The obvious compression function is

#+BEGIN_SRC java
  h(hashCode) = hashCode mod N.
#+END_SRC

Hash codes are often negative, so remember that mod is not the same as Java's
remainder operator "%".  If you compute hashCode % N, check if the result is
negative, and add N if it is.

With this compression function, no matter how long and variegated the keys are,
we can map them into a table whose size is not much greater than the actual
number of entries we want to store.  However, we've created a new problem:
several keys are hashed to the same bucket in the table if h(hashCode1) =
h(hashCode2).  This circumstance is called a _collision_.

How do we handle collisions without losing entries?  We use a simple idea
called _chaining_.  Instead of having each bucket in the table reference one
entry, we have it reference a linked list of entries, called a _chain_.  If
several keys are mapped to the same bucket, their definitions all reside in
that bucket's linked list.

Chaining creates a second problem:  how do we know which definition corresponds
to which word?  The answer is that we must store each key in the table with its
definition.  The easiest way to do this is to have each listnode store an
_entry_ that has references to both a key (the word) and an associated value
(its definition).

#+BEGIN_EXAMPLE
         ---   ----------------------------------------------------------
defTable |.+-->|   .   |   .   |   X   |   .   |   X   |   .   |   .   | ...
         ---   ----|-------|---------------|---------------|-------|-----
                   v       v               v               v       v
                  ---     ---             ---             ---     ---
                  |.+>pus |.+>evil        |.+>okthxbye    |.+>cool|.+>mud
                  |.+>goo |.+>C++         |.+>creep       |.+>jrs |.+>wet dirt
                  |.|     |X|             |X|             |.|     |X|
                  -+-     ---             ---             -+-     ---
                   |                                       |
                   v                                       v
                  ---                      ^              ---
                  |.+>sin              < chains >         |.+>twerk
                  |.+>have fun                            |.+>Miley burping
                  |X|                                     |X| the wrong way
                  ---                                     ---
#+END_EXAMPLE

Hash tables usually support at least three operations. An Entry object
references a key and its associated value.

- public Entry insert(key, value)
   - Compute the key's hash code and compress it to determine the entry's bucket.
   - Insert the entry (key and value together) into that bucket's list.
- public Entry find(key)
   - Hash the key to determine its bucket.  Search the list for an entry with the
   - given key.  If found, return the entry; otherwise, return null.
- public Entry remove(key)
   - Hash the key to determine its bucket.  Search the list for an entry with the
   - given key.  Remove it from the list if found.  Return the entry or null.

*What if two entries with the same key are inserted?* There are two approaches.

1)  Following Goodrich and Tamassia, we can insert both, and have find() or
   remove() arbitrarily return/remove one. Goodrich and Tamassia also propose a
   method findAll() that returns all the entries with a given key.
2)  Replace the old value with the new one, so only one entry with a given key
   exists in the table.
Which approach is best?  It depends on the application.

#+BEGIN_QUOTE
*WARNING*: When an object is stored as a key in a hash table, an application
should never change the object in a way that will change its hash code. If you
do so, the object will thenceforth be in the wrong bucket.
#+END_QUOTE

The _load_factor_ of a hash table is n/N, where n is the number of keys in the
table and N is the number of buckets. If the load factor stays below one (or a
small constant), and the hash code and compression function are "good," and
there are no duplicate keys, then the linked lists are all short, and each
operation takes O(1) time. However, if the load factor grows too large (n >> N),
performance is dominated by linked list operations and degenerates to O(n) time
(albeit with a much smaller constant factor than if you replaced the hash table
with one singly-linked list). A proper analysis requires a little probability
theory, so we'll put it off until near the end of the semester.
** what is a hash table?
1. a hash table is a data structure
2. offers fast *insertion and searching*
3. they are limited in size because they are *based on arrays*
   1. can be resized, but it should be avoided
4. they are hard to order

why hash table important?
#+BEGIN_EXAMPLE
i want the INFO with ID ---> compression(hashCode(ID)) ---> *directly* find id in hashtable and get INFO
#+END_EXAMPLE

