UCB_CS61_lec21.html

<div id="orga97ee5a" class="outline-2">
<h2 id="orga97ee5a"><span class="section-number-2">2</span> Hash Tables (the most common implementation of dictionaries)</h2>
<div class="outline-text-2" id="text-2">
<p>
Suppose n is the number of keys (words) whose definitions we want to store, and
suppose we use a table of N buckets, where N is perhaps a bit larger than n, but
much smaller than the number of <span class="underline">possible</span> keys. A hash table maps a huge set of
possible keys into N buckets by applying a <span class="underline">compression_function</span> to each hash
code. The obvious compression function is
</p>

<div class="org-src-container">
<pre class="src src-java">h(<span style="color: #ce537a; font-weight: bold;">hashCode</span>) = hashCode mod N.
</pre>
</div>

<p>
Hash codes are often negative, so remember that mod is not the same as Java's
remainder operator "%".  If you compute hashCode % N, check if the result is
negative, and add N if it is.
</p>

<p>
With this compression function, no matter how long and variegated the keys are,
we can map them into a table whose size is not much greater than the actual
number of entries we want to store.  However, we've created a new problem:
several keys are hashed to the same bucket in the table if h(hashCode1) =
h(hashCode2).  This circumstance is called a <span class="underline">collision</span>.
</p>

<p>
How do we handle collisions without losing entries?  We use a simple idea
called <span class="underline">chaining</span>.  Instead of having each bucket in the table reference one
entry, we have it reference a linked list of entries, called a <span class="underline">chain</span>.  If
several keys are mapped to the same bucket, their definitions all reside in
that bucket's linked list.
</p>

<p>
Chaining creates a second problem:  how do we know which definition corresponds
to which word?  The answer is that we must store each key in the table with its
definition.  The easiest way to do this is to have each listnode store an
<span class="underline">entry</span> that has references to both a key (the word) and an associated value
(its definition).
</p>

<pre class="example">
         ---   ----------------------------------------------------------
defTable |.+--&gt;|   .   |   .   |   X   |   .   |   X   |   .   |   .   | ...
         ---   ----|-------|---------------|---------------|-------|-----
                   v       v               v               v       v
                  ---     ---             ---             ---     ---
                  |.+&gt;pus |.+&gt;evil        |.+&gt;okthxbye    |.+&gt;cool|.+&gt;mud
                  |.+&gt;goo |.+&gt;C++         |.+&gt;creep       |.+&gt;jrs |.+&gt;wet dirt
                  |.|     |X|             |X|             |.|     |X|
                  -+-     ---             ---             -+-     ---
                   |                                       |
                   v                                       v
                  ---                      ^              ---
                  |.+&gt;sin              &lt; chains &gt;         |.+&gt;twerk
                  |.+&gt;have fun                            |.+&gt;Miley burping
                  |X|                                     |X| the wrong way
                  ---                                     ---
</pre>

<p>
Hash tables usually support at least three operations. An Entry object
references a key and its associated value.
</p>

<ul class="org-ul">
<li>public Entry insert(key, value)
<ul class="org-ul">
<li>Compute the key's hash code and compress it to determine the entry's bucket.</li>
<li>Insert the entry (key and value together) into that bucket's list.</li>
</ul></li>
<li>public Entry find(key)
<ul class="org-ul">
<li>Hash the key to determine its bucket.  Search the list for an entry with the</li>
<li>given key.  If found, return the entry; otherwise, return null.</li>
</ul></li>
<li>public Entry remove(key)
<ul class="org-ul">
<li>Hash the key to determine its bucket.  Search the list for an entry with the</li>
<li>given key.  Remove it from the list if found.  Return the entry or null.</li>
</ul></li>
</ul>

<p>
<b>What if two entries with the same key are inserted?</b> There are two approaches.
</p>

<ol class="org-ol">
<li>Following Goodrich and Tamassia, we can insert both, and have find() or
remove() arbitrarily return/remove one. Goodrich and Tamassia also propose a
method findAll() that returns all the entries with a given key.</li>
<li>Replace the old value with the new one, so only one entry with a given key
exists in the table.</li>
</ol>
<p>
Which approach is best?  It depends on the application.
</p>

<blockquote>
<p>
<b>WARNING</b>: When an object is stored as a key in a hash table, an application
should never change the object in a way that will change its hash code. If you
do so, the object will thenceforth be in the wrong bucket.
</p>
</blockquote>

<p>
The <span class="underline">load_factor</span> of a hash table is n/N, where n is the number of keys in the
table and N is the number of buckets. If the load factor stays below one (or a
small constant), and the hash code and compression function are "good," and
there are no duplicate keys, then the linked lists are all short, and each
operation takes O(1) time. However, if the load factor grows too large (n &gt;&gt; N),
performance is dominated by linked list operations and degenerates to O(n) time
(albeit with a much smaller constant factor than if you replaced the hash table
with one singly-linked list). A proper analysis requires a little probability
theory, so we'll put it off until near the end of the semester.
</p>
</div>
<div id="orga7ce9a3" class="outline-3">
<h3 id="orga7ce9a3"><span class="section-number-3">2.1</span> what is a hash table?</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>a hash table is a data structure</li>
<li>offers fast <b>insertion and searching</b></li>
<li>they are limited in size because they are <b>based on arrays</b>
<ol class="org-ol">
<li>can be resized, but it should be avoided</li>
</ol></li>
<li>they are hard to order</li>
</ol>

<p>
why hash table important?
</p>
<pre class="example">
i want the INFO with ID ---&gt; compression(hashCode(ID)) ---&gt; *directly* find id in hashtable and get INFO
</pre>
</div>
</div>
