UCB_CS61_lec21.org
** from Dictionaries to hashtable
    two-letter words and definitions

 - words is a key that addresses the definition 26 * 26 = 676 words.

 Insert a definition into dectionary:
 - function ~hashCode()~: maps each word, eg (key) to integer 0...675
 - index into array, we call it buckhead, where we're going to store the definition for that word

 #+BEGIN_SRC java
public class Word{
    public static final int
        LETTERS = 26,
        WORDS = LETTERS * LETTERS;
    private String word;

    public int hashCode(){
        return LETTERS * (word.charAt(0) - 'a') +
            (word.charAt(1) - 'a');
        // java treat a chararter as a number
        // char - 'a'  = 0...25
        // this is how you map a 2 letter word to a unique num
    }
}

public class WordDictionary{
    private Definition[] defTable = new Definition[Word.WORDS];
    public void insert(Word w, Definition d){
        defTable[w.hashCode()] = d;
    }

    Definition find(Word w){
        return defTable[w.hashCode()];
    }
}
 #+END_SRC

 #+BEGIN_EXAMPLE
 Problems with long letter word
 2 letter word ==> 26^2 items array
 3 letter word ==> 26^3
 n letter word ==> 26^n
 #+END_EXAMPLE

 #+BEGIN_QUOTE
 this number is too large to store in computer. now hashtable comes
 #+END_QUOTE

** hash table: java
#+BEGIN_SRC java
import java.util.Arrays;

public class HashFunction {

    String[] theArray;
    int arraySize;
    int itemsIntArray = 0;

    public static void main(String[] args){

    }
}

HashFunction(int size){
    arraySize = size;
    theArray = new String[size];
    Arrays.fill(theArray, "-1");
}
#+END_SRC
* Hash Codes and Compression Functions
Hash codes and compression functions are a bit of a black art. The ideal hash
code and compression function would map each key to a uniformly distributed
random bucket from zero to N - 1. By "random", I don't mean that the function is
different each time; a given key always hashes to the same bucket. I mean that
two different keys, however similar, will hash to independently chosen integers,
so the probability they'll collide is 1/N. This ideal is tricky to obtain.

In practice, it's easy to mess up and create far more collisions than necessary.
Let's consider bad compression functions first. Suppose the keys are integers,
and each integer's hash code is itself, so hashCode(i) = i.

Suppose we use the compression function h(hashCode) = hashCode mod N, and the
number N of buckets is 10,000.  Suppose for some reason that our application
only ever generates keys that are divisible by 4.  A number divisible by 4 mod
10,000 is still a number divisible by 4, so three quarters of the buckets are
never used!  Thus the average bucket has about four times as many entries as it
ought to.

The same compression function is much better if N is prime.  With N prime, even
if the hash codes are always divisible by 4, numbers larger than N often hash
to buckets not divisible by 4, so all the buckets can be used.

For reasons I won't explain (see Goodrich and Tamassia Section 9.2.4 if you're
interested),

#+BEGIN_EXAMPLE
  h(hashCode) = ((a * hashCode + b) mod p) mod N
#+END_EXAMPLE

is a yet better compression function. Here, a, b, and p are positive integers, p
is a large prime, and p >> N. Now, the number N of buckets doesn't need to be
prime.

I recommend always using a known good compression function like the two above.
Unfortunately, it's still possible to mess up by inventing a hash code that
creates lots of conflicts even before the compression function is used. We'll
discuss hash codes next lecture.
