UCB_CS61_lec21.html

<div id="org0718c29" class="outline-3">
<h3 id="org0718c29"><span class="section-number-3">2.2</span> from Dictionaries to hashtable</h3>
<div class="outline-text-3" id="text-2-2">
<p>
two-letter words and definitions
</p>

<ul class="org-ul">
<li>words is a key that addresses the definition 26 * 26 = 676 words.</li>
</ul>

<p>
Insert a definition into dectionary:
</p>
<ul class="org-ul">
<li>function <code>hashCode()</code>: maps each word, eg (key) to integer 0&#x2026;675</li>
<li>index into array, we call it buckhead, where we're going to store the definition for that word</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Word</span>{
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">int</span>
        <span style="color: #7590db;">LETTERS</span> = <span style="color: #a45bad;">26</span>,
        <span style="color: #7590db;">WORDS</span> = LETTERS * LETTERS;
    <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">word</span>;

    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">hashCode</span>(){
        <span style="color: #4f97d7; font-weight: bold;">return</span> LETTERS * (word.charAt(<span style="color: #a45bad;">0</span>) - <span style="color: #2d9574;">'a'</span>) +
            (word.charAt(<span style="color: #a45bad;">1</span>) - <span style="color: #2d9574;">'a'</span>);
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">java treat a chararter as a number</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">char - 'a'  = 0...25</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">this is how you map a 2 letter word to a unique num</span>
    }
}

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">WordDictionary</span>{
    <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">Definition</span>[] <span style="color: #7590db;">defTable</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Definition</span>[<span style="color: #a45bad;">Word</span>.WORDS];
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">insert</span>(<span style="color: #ce537a; font-weight: bold;">Word</span> <span style="color: #7590db;">w</span>, <span style="color: #ce537a; font-weight: bold;">Definition</span> <span style="color: #7590db;">d</span>){
        defTable[w.hashCode()] = d;
    }

    <span style="color: #ce537a; font-weight: bold;">Definition</span> <span style="color: #bc6ec5; font-weight: bold;">find</span>(<span style="color: #ce537a; font-weight: bold;">Word</span> <span style="color: #7590db;">w</span>){
        <span style="color: #4f97d7; font-weight: bold;">return</span> defTable[w.hashCode()];
    }
}
</pre>
</div>

<pre class="example">
Problems with long letter word
2 letter word ==&gt; 26^2 items array
3 letter word ==&gt; 26^3
n letter word ==&gt; 26^n
</pre>

<blockquote>
<p>
this number is too large to store in computer. now hashtable comes
</p>
</blockquote>
</div>
</div>

<div id="org9298ed2" class="outline-3">
<h3 id="org9298ed2"><span class="section-number-3">2.3</span> hash table: java</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">util</span>.<span style="color: #ce537a; font-weight: bold;">Arrays</span>;

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">HashFunction</span> {

    <span style="color: #ce537a; font-weight: bold;">String</span>[] <span style="color: #7590db;">theArray</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">arraySize</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">itemsIntArray</span> = <span style="color: #a45bad;">0</span>;

    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">String</span>[] <span style="color: #7590db;">args</span>){

    }
}

<span style="color: #bc6ec5; font-weight: bold;">HashFunction</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">size</span>){
    arraySize = size;
    theArray = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">String</span>[size];
    Arrays.fill(theArray, <span style="color: #2d9574;">"-1"</span>);
}
</pre>
</div>
</div>
</div>
</div>
<div id="org82cc3ec" class="outline-2">
<h2 id="org82cc3ec"><span class="section-number-2">3</span> Hash Codes and Compression Functions</h2>
<div class="outline-text-2" id="text-3">
<p>
Hash codes and compression functions are a bit of a black art. The ideal hash
code and compression function would map each key to a uniformly distributed
random bucket from zero to N - 1. By "random", I don't mean that the function is
different each time; a given key always hashes to the same bucket. I mean that
two different keys, however similar, will hash to independently chosen integers,
so the probability they'll collide is 1/N. This ideal is tricky to obtain.
</p>

<p>
In practice, it's easy to mess up and create far more collisions than necessary.
Let's consider bad compression functions first. Suppose the keys are integers,
and each integer's hash code is itself, so hashCode(i) = i.
</p>

<p>
Suppose we use the compression function h(hashCode) = hashCode mod N, and the
number N of buckets is 10,000.  Suppose for some reason that our application
only ever generates keys that are divisible by 4.  A number divisible by 4 mod
10,000 is still a number divisible by 4, so three quarters of the buckets are
never used!  Thus the average bucket has about four times as many entries as it
ought to.
</p>

<p>
The same compression function is much better if N is prime.  With N prime, even
if the hash codes are always divisible by 4, numbers larger than N often hash
to buckets not divisible by 4, so all the buckets can be used.
</p>

<p>
For reasons I won't explain (see Goodrich and Tamassia Section 9.2.4 if you're
interested),
</p>

<pre class="example">
h(hashCode) = ((a * hashCode + b) mod p) mod N
</pre>

<p>
is a yet better compression function. Here, a, b, and p are positive integers, p
is a large prime, and p &gt;&gt; N. Now, the number N of buckets doesn't need to be
prime.
</p>

<p>
I recommend always using a known good compression function like the two above.
Unfortunately, it's still possible to mess up by inventing a hash code that
creates lots of conflicts even before the compression function is used. We'll
discuss hash codes next lecture.
</p>
</div>
