UCB_CS61_lec21.org
** hashcode: lec-note
| notation | meaning                                               |
|----------+-------------------------------------------------------|
| n        | numbers of keys(words) actually you want to store     |
| N        | table of N buckets, N a bit longer than n, 20% longer |

A hash table maps huge set of possible keys into N buckest by applying a
compression function to each hash code

- n : i can still map every possible english word to a number from 0 ~ 26^45
- N : but then i will compress it down, so that i'm not using more than a million buckets

~h(hashCode) = hashCode mod N~
- h is the name of compression function
- hashCode ofen negative
- because 'mod N' is a random *compression*, you will have collisions

*Collision*:
several keys hash to same bucket; ~if h(hashCode1) = h(hashCode2)~

*How to solve Collision --- Chaining*: chaining*, each bucket is *no longer
*store just one word*, instead, store *a references a linked list of entries*,
*that link is called a ~chain~.

then, when i seach a definition of a word, how to locate it in this chain? Not
just install the definitions, i have to store the original words as well. Store
eahc key in table with definition, as a pair in that table.

#+BEGIN_EXAMPLE
entry = (key, value)
#+END_EXAMPLE


~1.insert(key,value)~ , when getting key and value, it combines them together
   into an entry object and stores that entry in the hash table and for some
   reason here 'insert' will also return the entry object creates to store your
   key in your value

~public Entry insert(key, value)~
   - compute the key's hash code
   - compress it to determine bucket.
   - insert the entry into the bucket's chain

~public Entry find(key)~
   - hash the key to hash code
   - search chain for entry with given key
   - if found, return it; else null.

~public Entry remove(key)~
   - hash key to hash code
   - search the chain of bucket
   - remove from chain if found
   - return entry or null.


But, still hava some issues:
#+BEGIN_QUOTE
what if you try to insert multiple copies of the same key into the dictionary,
like maybe a word has two different definitions and you want to put each of
those definitions in as a separate entry.
#+END_QUOTE

2 entries in same key. 2 approaches to handle this:

1. G&T(book): insert both, find() arbitrary returns one. also this book give a findALL() function
   to give all items matching a certain key.
   so now your chain has tow different entries in it that have the
   same key or five different entries or 100 diffenent entries.
2. Replace old value with new. Only one entry has given key.

how to choose, depend on your application.
    #+BEGIN_QUOTE
*A Big Warning*: insert sth into hash, eg an refference of object, you should
NOT change the object, once you do, this will change its hashCode, because you
change an object in a way that changes its hashcode, will make this object in
the WRONG bucket and you'll never be able to look it up again.

    #+END_QUOTE

** Performance of Hash Table:
performance of hash table is depand on how *much* stuff you try to pack into how
*big* a hash table

Load factor of a hash table:
#+BEGIN_EXAMPLE
n/N = (items you want to store into hashtable)/(number of buckets)
#+END_EXAMPLE

If load factor stay low, and if hash code & compress function are 'good', and no
duplicate keys , THEN the chains are short, & each opreation takes O(1) time.
And performance of hash table ,also depends on how big the chain is, that you
have to search. if chain is big , it'll take >O(1)

: If load factor get BIG(n>>N), O(n) time.

** Troublesome 1: Compression fn
    #+BEGIN_EXAMPLE
key -------(hashcode func)------> hashcode ----(compression func)------> bucket[0,N-1]
    #+END_EXAMPLE

*Ideal*: Map each key to a random bucket(use random function). with each bucket
being equally likely.

Bad compression function,eg:
#+BEGIN_EXAMPLE
suppose keys are ints.
hashCode(i) = i.
Compression function h(hashCode) = hashCode mod N
N = 10,000 buckets.
Suppose keys are divisible by 4.
h() is divisible by 4 too.
Very Bad news, because 3/4 of our buckets are wasted.
this means every bucket has a chain of 4 entries ,need handle with 4 collision.
#+END_EXAMPLE

Some compression fn better if N is prime, any num mod N, they won't be divisible
by any particular number.

#+BEGIN_EXAMPLE
Better: chap9.2.4 of G&T
h(hashCode) = ((a*hashCode + b) mod p) mod N)
a,b,p : positive integers
p: large prime
p >> N

'mod p' as scrambling the bits really well;
'mod N' make it fit in your table
#+END_EXAMPLE

the advantage of this over below, is now, N(buckets) dosen't need to be prime.

** Troublesome 2: H
