UCB_CS61_lec21.html
<div id="org21edcef" class="outline-3">
<h3 id="org21edcef"><span class="section-number-3">3.1</span> hashcode: lec-note</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">notation</th>
<th scope="col" class="org-left">meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">n</td>
<td class="org-left">numbers of keys(words) actually you want to store</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left">table of N buckets, N a bit longer than n, 20% longer</td>
</tr>
</tbody>
</table>

<p>
A hash table maps huge set of possible keys into N buckest by applying a
compression function to each hash code
</p>

<ul class="org-ul">
<li>n : i can still map every possible english word to a number from 0 ~ 26^45</li>
<li>N : but then i will compress it down, so that i'm not using more than a million buckets</li>
</ul>

<p>
<code>h(hashCode) = hashCode mod N</code>
</p>
<ul class="org-ul">
<li>h is the name of compression function</li>
<li>hashCode ofen negative</li>
<li>because 'mod N' is a random <b>compression</b>, you will have collisions</li>
</ul>

<p>
<b>Collision</b>:
several keys hash to same bucket; <code>if h(hashCode1) = h(hashCode2)</code>
</p>

<p>
<b>How to solve Collision &#x2014; Chaining</b>: chaining*, each bucket is <b>no longer
*store just one word</b>, instead, store <b>a references a linked list of entries</b>,
*that link is called a <code>chain</code>.
</p>

<p>
then, when i seach a definition of a word, how to locate it in this chain? Not
just install the definitions, i have to store the original words as well. Store
eahc key in table with definition, as a pair in that table.
</p>

<pre class="example">
entry = (key, value)
</pre>


<p>
<code>1.insert(key,value)</code> , when getting key and value, it combines them together
   into an entry object and stores that entry in the hash table and for some
   reason here 'insert' will also return the entry object creates to store your
   key in your value
</p>

<p>
<code>public Entry insert(key, value)</code>
</p>
<ul class="org-ul">
<li>compute the key's hash code</li>
<li>compress it to determine bucket.</li>
<li>insert the entry into the bucket's chain</li>
</ul>

<p>
<code>public Entry find(key)</code>
</p>
<ul class="org-ul">
<li>hash the key to hash code</li>
<li>search chain for entry with given key</li>
<li>if found, return it; else null.</li>
</ul>

<p>
<code>public Entry remove(key)</code>
</p>
<ul class="org-ul">
<li>hash key to hash code</li>
<li>search the chain of bucket</li>
<li>remove from chain if found</li>
<li>return entry or null.</li>
</ul>


<p>
But, still hava some issues:
</p>
<blockquote>
<p>
what if you try to insert multiple copies of the same key into the dictionary,
like maybe a word has two different definitions and you want to put each of
those definitions in as a separate entry.
</p>
</blockquote>

<p>
2 entries in same key. 2 approaches to handle this:
</p>

<ol class="org-ol">
<li>G&amp;T(book): insert both, find() arbitrary returns one. also this book give a findALL() function
to give all items matching a certain key.
so now your chain has tow different entries in it that have the
same key or five different entries or 100 diffenent entries.</li>
<li>Replace old value with new. Only one entry has given key.</li>
</ol>

<p>
how to choose, depend on your application.
</p>
<blockquote>
<p>
<b>A Big Warning</b>: insert sth into hash, eg an refference of object, you should
NOT change the object, once you do, this will change its hashCode, because you
change an object in a way that changes its hashcode, will make this object in
the WRONG bucket and you'll never be able to look it up again.
</p>
</blockquote>
</div>
</div>

<div id="orgacd9eb9" class="outline-3">
<h3 id="orgacd9eb9"><span class="section-number-3">3.2</span> Performance of Hash Table:</h3>
<div class="outline-text-3" id="text-3-2">
<p>
performance of hash table is depand on how <b>much</b> stuff you try to pack into how
<b>big</b> a hash table
</p>

<p>
Load factor of a hash table:
</p>
<pre class="example">
n/N = (items you want to store into hashtable)/(number of buckets)
</pre>

<p>
If load factor stay low, and if hash code &amp; compress function are 'good', and no
duplicate keys , THEN the chains are short, &amp; each opreation takes O(1) time.
And performance of hash table ,also depends on how big the chain is, that you
have to search. if chain is big , it'll take &gt;O(1)
</p>

<pre class="example">
If load factor get BIG(n&gt;&gt;N), O(n) time.

</pre>
</div>
</div>

<div id="org2b54082" class="outline-3">
<h3 id="org2b54082"><span class="section-number-3">3.3</span> Troublesome 1: Compression fn</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
key -------(hashcode func)------&gt; hashcode ----(compression func)------&gt; bucket[0,N-1]
</pre>

<p>
<b>Ideal</b>: Map each key to a random bucket(use random function). with each bucket
being equally likely.
</p>

<p>
Bad compression function,eg:
</p>
<pre class="example">
suppose keys are ints.
hashCode(i) = i.
Compression function h(hashCode) = hashCode mod N
N = 10,000 buckets.
Suppose keys are divisible by 4.
h() is divisible by 4 too.
Very Bad news, because 3/4 of our buckets are wasted.
this means every bucket has a chain of 4 entries ,need handle with 4 collision.
</pre>

<p>
Some compression fn better if N is prime, any num mod N, they won't be divisible
by any particular number.
</p>

<pre class="example">
Better: chap9.2.4 of G&amp;T
h(hashCode) = ((a*hashCode + b) mod p) mod N)
a,b,p : positive integers
p: large prime
p &gt;&gt; N

'mod p' as scrambling the bits really well;
'mod N' make it fit in your table
</pre>

<p>
the advantage of this over below, is now, N(buckets) dosen't need to be prime.
</p>
</div>
</div>

<div id="org8eee088" class="outline-3">
<h3 id="org8eee088"><span class="section-number-3">3.4</span> Troublesome 2: H</h3>
</div>
</div>
</div>
</body>
</html>
